perf_output/before/memcached-1.5.20/16/memcached-1.5.20_workloadc_16_load.txt
[WARN]  Running against a source checkout. In order to get our runtime dependencies we'll have to invoke Maven. Depending on the state of your system, this may take ~30-45 seconds
[DEBUG]  Running 'mvn -pl site.ycsb:memcached-binding -am package -DskipTests dependency:build-classpath -DincludeScope=compile -Dmdep.outputFilterFile=true'
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by com.google.inject.internal.cglib.core.$ReflectUtils$1 (file:/usr/share/maven/lib/guice.jar) to method java.lang.ClassLoader.defineClass(java.lang.String,byte[],int,int,java.security.ProtectionDomain)
WARNING: Please consider reporting this to the maintainers of com.google.inject.internal.cglib.core.$ReflectUtils$1
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
java -cp /proj/proxyweb-PG0/adona/YCSB/memcached/conf:/proj/proxyweb-PG0/adona/YCSB/memcached/target/memcached-binding-0.18.0-SNAPSHOT.jar:/root/.m2/repository/org/apache/htrace/htrace-core4/4.1.0-incubating/htrace-core4-4.1.0-incubating.jar:/root/.m2/repository/org/hdrhistogram/HdrHistogram/2.1.4/HdrHistogram-2.1.4.jar:/root/.m2/repository/log4j/log4j/1.2.17/log4j-1.2.17.jar:/root/.m2/repository/org/codehaus/jackson/jackson-mapper-asl/1.9.13/jackson-mapper-asl-1.9.13.jar:/root/.m2/repository/net/spy/spymemcached/2.11.4/spymemcached-2.11.4.jar:/root/.m2/repository/org/codehaus/jackson/jackson-core-asl/1.9.4/jackson-core-asl-1.9.4.jar:/proj/proxyweb-PG0/adona/YCSB/core/target/core-0.18.0-SNAPSHOT.jar site.ycsb.Client -db site.ycsb.db.MemcachedClient -threads 16 -s -P workloads/workloadc -p memcached.hosts=localhost:11211 -load
Command line: -db site.ycsb.db.MemcachedClient -threads 16 -s -P workloads/workloadc -p memcached.hosts=localhost:11211 -load
YCSB Client 0.18.0-SNAPSHOT

Loading workload...
log4j:WARN No appenders could be found for logger (org.apache.htrace.core.Tracer).
log4j:WARN Please initialize the log4j system properly.
log4j:WARN See http://logging.apache.org/log4j/1.2/faq.html#noconfig for more info.
Starting test.
2021-08-11 17:33:09:088 0 sec: 0 operations; est completion in 106751991167300 days 15 hours 
2021-08-11 17:33:09.198 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:09.198 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:09.198 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:09.200 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:09.199 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:09.201 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:09.202 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:09.203 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2021-08-11 17:33:09.203 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:09.204 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:09.205 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:09.205 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:09.206 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:09.207 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:09.207 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
2021-08-11 17:33:09.208 INFO net.spy.memcached.MemcachedConnection:  Added {QA sa=localhost/127.0.0.1:11211, #Rops=0, #Wops=0, #iq=0, topRop=null, topWop=null, toWrite=0, interested=0} to connect queue
Error inserting, not retrying any more. number of attempts: 1Insertion Retry Limit: 0
Error inserting, not retrying any more. number of attempts: 1Insertion Retry Limit: 0
Error inserting, not retrying any more. number of attempts: 1Insertion Retry Limit: 0
[...]
2021-08-11 17:33:09.321 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:09.321 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:09.321 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:09.323 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:09.322 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:09.324 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:09.323 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:09.325 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:09.326 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:09.326 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:09.327 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:09.328 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:09.328 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:09.329 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:09.329 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:09.330 INFO net.spy.memcached.MemcachedConnection:  Shut down memcached client
2021-08-11 17:33:09:324 0 sec: 0 operations; est completion in 106751991167300 days 15 hours [CLEANUP: Count=16, Max=7431, Min=5720, Avg=6497.75, 90=6871, 99=7431, 99.9=7431, 99.99=7431] [INSERT: Count=0, Max=0, Min=9223372036854775807, Avg=NaN, 90=0, 99=0, 99.9=0, 99.99=0] [INSERT-FAILED: Count=16, Max=93887, Min=89472, Avg=92572, 90=93695, 99=93887, 99.9=93887, 99.99=93887] 
[OVERALL], RunTime(ms), 237
[OVERALL], Throughput(ops/sec), 0.0
[TOTAL_GCS_G1_Young_Generation], Count, 0
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 6497.75
[CLEANUP], MinLatency(us), 5720
[CLEANUP], MaxLatency(us), 7431
[CLEANUP], 95thPercentileLatency(us), 7019
[CLEANUP], 99thPercentileLatency(us), 7431
[INSERT], Operations, 0
[INSERT], AverageLatency(us), NaN
[INSERT], MinLatency(us), 9223372036854775807
[INSERT], MaxLatency(us), 0
[INSERT], 95thPercentileLatency(us), 0
[INSERT], 99thPercentileLatency(us), 0
[INSERT], Return=ERROR, 16
[INSERT-FAILED], Operations, 16
[INSERT-FAILED], AverageLatency(us), 92572.0
[INSERT-FAILED], MinLatency(us), 89472
[INSERT-FAILED], MaxLatency(us), 93887
[INSERT-FAILED], 95thPercentileLatency(us), 93695
[INSERT-FAILED], 99thPercentileLatency(us), 93887

 Performance counter stats for 'system wide':

       47100153459      cycles                                                        (66.66%)
        8321724815      branches                                                      (66.66%)
         345879491      branch-misses             #    4.16% of all branches          (66.66%)
        8276883766      branch-loads                                                  (66.67%)
         345161424      branch-load-misses                                            (66.68%)
         489943659      L1-icache-load-misses                                         (66.68%)

      12.383752668 seconds time elapsed